docs/cimsession_flow/04_Req_pull.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd">
    <s:Header>
        <a:To>http://smnnovmsfs01:5985/wsman</a:To>
        <w:ResourceURI s:mustUnderstand="true">http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/win32_diskdrive</w:ResourceURI>
        <a:ReplyTo>
            <a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
        </a:ReplyTo>
        <a:Action s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/enumeration/Pull</a:Action>
        <w:MaxEnvelopeSize s:mustUnderstand="true">512000</w:MaxEnvelopeSize>
        <a:MessageID>uuid:A62E3123-EFF2-4F2C-BA9C-EA59B4D7EC0D</a:MessageID>
        <w:Locale xml:lang="en-US" s:mustUnderstand="false" />
        <p:DataLocale xml:lang="en-US" s:mustUnderstand="false" />
        <p:SessionId s:mustUnderstand="false">uuid:5E56B8CB-5397-449C-B200-6F6401F1F39C</p:SessionId>
        <p:OperationID s:mustUnderstand="false">uuid:7EE99D77-9A8E-4C53-9349-A6DB7AE09AB5</p:OperationID>
        <p:SequenceId s:mustUnderstand="false">1</p:SequenceId>
        <w:SelectorSet>
            <w:Selector Name="__cimnamespace">root/cimv2</w:Selector>
        </w:SelectorSet>
        <w:OptionSet xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <w:Option Name="__MI_CallbackRegistration" Type="xs:int">11</w:Option>
            <w:Option Name="wmiarray:__MI_OPERATIONOPTIONS_CHANNELVALUE" Type="xs:unsignedInt">0</w:Option>
            <w:Option Name="wmiarray:__MI_OPERATIONOPTIONS_CHANNELVALUE" Type="xs:unsignedInt">1</w:Option>
            <w:Option Name="wmiarray:__MI_OPERATIONOPTIONS_CHANNELVALUE" Type="xs:unsignedInt">2</w:Option>
            <w:Option Name="wmi:__MI_OPERATIONOPTIONS_WRITEERRORMODE" Type="xs:unsignedInt">1</w:Option>
            <w:Option Name="msftwinrm:UsePreciseArrays" Type="xs:boolean">true</w:Option>
        </w:OptionSet>
    </s:Header>
    <s:Body>
        <n:Pull>
            <n:EnumerationContext xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration">uuid:686ECA2F-690B-4013-8516-EAEFBEAAAD02</n:EnumerationContext>
            <n:MaxElements>32000</n:MaxElements>
        </n:Pull>
    </s:Body>
</s:Envelope>